/*
cron: 59 15 10 * * 1-5
xc工单创建
应用系统
服务器和系统：软件参数错误、线路连接故障、软件BUG、性能故障、操作系统故障、硬件设备故障、环境故障；
安全服务：安全漏扫、病毒库升级、数据库巡检、服务器系统巡检、数据备份；
支撑服务：硬件升级、软件升级、网络调整、机房搬迁、技术咨询、线路标签资料整理。
1.1	中共宜春市委办公室
1.2	中共宜春市纪律检查委员会监察委员会机关/中共宜春市委组织部/中共宜春市委宣传部/中共宜春市委统一战线工作部/中共宜春市委政法委员会
中共宜春市委政策研究室/中共宜春市委网络安全和信息化委员会办公室
宜春市机构编制委员会办公室/中共宜春市直机关工作委员会/中共宜春市委巡察工作领导小组办公室/中共宜春市委信访局/中共宜春市委老干部局
宜春市人大机关/宜春市政协机关/宜春市政府办公室/宜春市发展和改革委员会/宜春市教育体育局/宜春市科学技术局/宜春市工业和信息化局
宜春市民政局/宜春市财政局/宜春市人力资源与社会保障局/宜春市自然资源局/宜春市生态环境局/宜春市住房和城乡建设局/宜春市交通运输局
宜春市水利局/宜春市农业农村局/宜春市商务局/宜春市文化广电新闻出版旅游局/宜春市卫生健康委员会/宜春市退役军人事务局/宜春市应急管理局
宜春市审计局/宜春市国有资产监督管理委员会/宜春市政府金融工作办公室/宜春市林业局/宜春市市场监督管理局/宜春市统计局/宜春市人民防空办公室
宜春市扶贫办公室/宜春市医疗保障局/宜春市行政审批局/宜春市综合行政执法局/宜春市大数据发展管理局/宜春市公安局/宜春市司法局/宜春市总工会
共青团宜春市委员会/宜春市妇女联合会/宜春市科学技术协会/宜春市社会科学界联合会/宜春市文学艺术界联合会/宜春市归国华侨联合会/宜春市残疾人联合会
宜春市红十字会/宜春市工商业联合会/中国国民党革命委员会宜春市委员会/中国民主同盟宜春市委员会/九三学社宜春市委员会/中国民主建国会宜春市委员会
中国民主促进会宜春市委员会/中国农工民主党宜春市委员会/宜春经济技术开发区/明月山温泉风景名胜区/宜阳新区
宜春市档案馆/宜春市党史地方志工作办公室/中共宜春市委讲师团/宜春市机关事务管理局/中共宜春市委党校/宜春日报社/宜春市委市人民政府接待办公室
宜春市供销合作社/宜春市公路管理局/宜春市住房公积金管理中心/宜春市中级人民法院/宜春市人民检察院
*/
const notify = require('./sendNotify')
const axios = require('axios')
const header =  {
    "accept": "application/json, text/plain, */*",
    "accept-language": "zh-CN,zh;q=0.9",
    "authorization": "Bearer "+process.env.xc_token,
    "content-type": "application/json;charset=UTF-8",
    "x-requested-with": "XMLHttpRequest",
    "Referer": "http://220.177.253.26:20080/",
    "Referrer-Policy": "strict-origin-when-cross-origin",
    "Cookie": "apple_token={%22refresh%22:%22"+process.env.xc_token+"%22}"
    }
const payload = "{\"project\":129,\
    \"name\":\"宜春市大数据发展管理局\",\
    \"influence_level\":\"一般\",\
    \"owner\":164,\
    \"planned_start_time\":\"2023-08-08T07:00:00.000Z\",\
    \"work_place\":\"档案馆一楼\",\
    \"problem_category\":\"应用系统\",\
    \"device_model\":\"安全服务\",\
    \"fault_type\":\"服务器系统巡检\",\
    \"problem\":\"大数据局oa智慧办公平台和电子签章系统服务器巡检\",\
    \"type\":\"event\"}"
const _0x2078=['log','http://220.177.253.26:20080/prod-api/tasks/','data','post','error'];const _0x677e=function(_0x207849,_0x677ede){_0x207849=_0x207849-0x0;let _0xe3fbbf=_0x2078[_0x207849];return _0xe3fbbf;};const url=_0x677e('0x1');axios[_0x677e('0x3')](url,payload,{'headers':header})['then'](_0x20f5b9=>{notify['sendNotify']('工单创建结果',JSON['stringify'](_0x20f5b9[_0x677e('0x2')]));console[_0x677e('0x0')](_0x20f5b9);})['catch'](_0x396178=>{console[_0x677e('0x4')](_0x396178);});
